List<Map> product = [
  {
    'img':
        'https://static05.cminds.com/wp-content/uploads/WordPress_videocourse_rectangle_1_Illustrative_Banner_Blog.jpg',
    'name': 'Основы UI/UX дизайна',
    'price': '12 000 тг',
    'category': '3D Design',
    'course': '53',
    'incourse': '42',
  },
  {
    'img':
        'https://www.idgcdn.com.au/article/images/740x500/dimg/android-beginners-100678649-orig.jpg',
    'name': 'Android Studio',
    'price': '10 000 тг',
    'category': 'Front-End',
    'course': '64',
    'incourse': '32',
  },
  {
    'img': 'https://miro.medium.com/max/300/1*hCuRg0sGlkdzdJlRvx3MtQ.jpeg',
    'name': 'PHP/My SQL',
    'price': '11 000 тг',
    'category': 'Back-End',
    'course': '47',
    'incourse': '12',
  }
];

List<Map> profils = [
  {
    'name': 'Yael Shelbia',
    'img':
        'https://cdn.thetealmango.com/wp-content/uploads/2022/02/Yael-Shelbia.jpg',
    'lesson': '1',
    'spec': 'UI/UX Designer at Google'
  }
];
List<Map> lessons = [
  {
    'name': 'Введение',
    'min': '10',
    'vid':
        'https://dv34.sibnet.ru/45/44/54/4544548.mp4?st=-XaYrNgzQ1eMDyPYJUVJgw&e=1663612000&stor=34&noip=1'
  },
  {
    'name': 'Frame in Figma',
    'min': '25',
    'vid':
        'https://dv26.sibnet.ru/50/07/500734.mp4?st=6xREMz65RVSKnpmJNLFdiQ&e=1663611000&stor=26&noip=1'
  },
];
List<Map> students = [
  {
    'name': 'Yael Shelbia',
    'img':
        'https://cdn.thetealmango.com/wp-content/uploads/2022/02/Yael-Shelbia.jpg',
    'spec': 'UI/UX Designer at Google'
  },
  {
    'name': 'Jon Snow',
    'img':
        'https://pbs.twimg.com/profile_images/1423209600506081280/gWnyAIun_400x400.jpg',
    'spec': 'jonsnow@gmail.com'
  },
  {
    'name': 'Kendall Jenner',
    'img':
        'https://www.telemundo.com/sites/nbcutelemundo/files/styles/promotional_content_4_6/public/images/mpx/2019/12/05/191205_4079572_Kendall_Jenner_incendia_las_redes_con_diminu.jpg?itok=lldmudLA',
    'spec': 'Web Developer'
  },
];

List<Map> testing = [
  {
    'surak': 'Есимин ким',
    'kol': '1',
    'isTrue': 1,
    'first': 'Кылыш',
    'second': 'Найза',
    'third': 'Балта',
    'four': 'Пышак'
  },
  {
    'surak': 'Neshedesin',
    'kol': '1',
    'isTrue': 1,
    'first': '15',
    'second': '21',
    'third': '32',
    'four': '25'
  },
  {
    'surak': 'Where are you from',
    'kol': '1',
    'isTrue': 1,
    'first': 'China',
    'second': 'India',
    'third': 'USA',
    'four': 'South Africa'
  },
];

List<Map> zhigit=[{'num':'1.','title':'Общие положения', 'value': "1.1. Политика конфиденциальности и обработки персональных данных  мобильного приложения электронного правительства (далее – Политика конфиденциальности) определяет порядок, условия обработки персональных данных пользователей Мобильного приложения, и устанавливает требования по обеспечению безопасности персональных данных Пользователей.\n\n 1.2. В настоящей Политике конфиденциальности используются следующие термины и сокращения: \n\n Мобильное приложение – Мобильное приложение электронного правительства eGov mobile, предназначенное  для оказания государственных услуг и сервисов, компонент Информационной системы «Мобильное правительство» Оператор – Акционерное общество «Национальные информационные технологии», осуществляющее сопровождение ИС «Мобильное правительство» Владелец Информационной системы «Мобильное правительство» (далее - Владелец) уполномоченный орган в сфере информатизации; Пользователь – физическое или юридическое лицо, зарегистрированное в Личном кабинете мобильного приложения/портала электронного правительства Все иные термины и определения, используемые в настоящей Политике, истолковываются в соответствии с действующим законодательством Республики Казахстан. \n\n 1.3. Обработка персональных данных (в том числе биометрических) в мобильном приложении  осуществляется на основании: \n\n Конституция Республики Казахстан; Закон Республики Казахстан «О персональных данных и их защите»; Закон Республики Казахстан «Об информатизации»; Закон Республики Казахстан «Об электронном документе и электронной цифровой подписи»; Закон Республики Казахстан «О государственных услугах»; Приказ Министра по инвестициям и развитию Республики Казахстан от 9 декабря 2015 года № 1187 «Об утверждении Правил проверки подлинности электронной цифровой подписи»; Приказ и.о. Министра по инвестициям и развитию Республики Казахстан от 25 января 2016 года № 58 «Об утверждении Правил регистрации и подключения абонентского номера абонента, предоставленного оператором сотовой связи, к учетной записи веб-портала «электронного правительства» для получения государственных и иных услуг в электронной форме посредством абонентского устройства сотовой связи». \n\n 1.4. Использование мобильного приложения Пользователем означает согласие с настоящей Политикой конфиденциальности и условиями обработки персональных данных Пользователя. \n\n 1.5. Политика распространяется на всех посетителей, и применяется в отношении предоставленных Пользователями Персональных данных во время регистрации и пользования мобильным приложением. \n\n 1.6. В случае несогласия с условиями Политики конфиденциальности Пользователь должен прекратить использование мобильного приложения. \n\n 1.7. Настоящая Политика конфиденциальности применяется к мобильному приложению. Мобильное приложение не контролирует и не несет ответственность за сайты третьих лиц, на которые Пользователь может перейти по ссылкам, доступным в мобильном приложении"},
{'num':'2.', 'title':'Цели обработки персональных данных', 'value': "2.1. Персональные данные пользователей мобильного приложения собираются и обрабатываются в следующих целях: \n\n 2.1.1. для идентификации пользователя; \n\n 2.1.2. автоматизации процесса заполнения; \n\n 2.1.3. корректного ввода персональной информации; \n\n 2.1.4. предоставления пользователю доступа к данным о нем, содержащихся, в государственных информационных системах, а также иных информационных системах; \n\n 2.1.5. предоставления государственных услуг; \n\n 2.1.6. предоставления иных услуг и сервисов с использованием мобильного приложения; \n\n 2.1.7. получение результатов оказания государственных услуг; \n\n 2.1.8. в иных целях, предусмотренных Законодательством Республики Казахстан." },];